status/2021/11jun21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>05 June 2021 - 11 June 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">05 June 2021 - 11 June 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org723dfaa">1. Linux Audio</a>
<ul>
<li><a href="#org137e9be">1.1. Faust programming</a>
<ul>
<li><a href="#orgb75c552">1.1.1. GAC code updates</a></li>
<li><a href="#orgb2b65f7">1.1.2. xrso12332</a></li>
</ul>
</li>
<li><a href="#orgafacf83">1.2. Next Steps</a>
<ul>
<li><a href="#org1809145">1.2.1. Analog Synthesizer modules</a></li>
<li><a href="#orgdb8cec5">1.2.2. GAC Patch save/restore</a></li>
<li><a href="#org8abfbe3">1.2.3. LV2 autopatcher</a></li>
<li><a href="#orgf60b5e5">1.2.4. OSC control surface</a></li>
<li><a href="#org776d22c">1.2.5. Faust/csound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org583a212">2. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org97d50b6">2.1. Next step</a>
<ul>
<li><a href="#org968afdb">2.1.1. Check replacement sensor</a></li>
<li><a href="#orge3fa467">2.1.2. Clean BME680/VELM6075 boards</a></li>
<li><a href="#orgd60b724">2.1.3. Design more robust instrument shelter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1dfe8c1">3. EPICS</a>
<ul>
<li><a href="#orga9dd59c">3.1. Next steps</a>
<ul>
<li><a href="#orgbd2ccd3">3.1.1. u3scpi network port testing</a></li>
<li><a href="#org4975e0a">3.1.2. initial EPICS interface</a></li>
<li><a href="#orgad71e8c">3.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4e7b9d">4. Brini Tracker II</a>
<ul>
<li><a href="#org472bc3d">4.1. Next steps</a>
<ul>
<li><a href="#orgf74e2e4">4.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org3c2413a">4.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org5799229">4.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga850ce0">5. wktcolor</a>
<ul>
<li><a href="#org1cc75ae">5.1. Next steps</a>
<ul>
<li><a href="#org364c7c4">5.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb5f740c">6. wktplot</a>
<ul>
<li><a href="#org0ca09e7">6.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org41888b9">7. ca-r</a>
<ul>
<li><a href="#orgb067841">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#orgb09cdc3">8. AMDGPU</a>
<ul>
<li><a href="#org31e2759">8.1. Next step</a>
<ul>
<li><a href="#orgf76725e">8.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0d271a2">9. Ninja v Make</a>
<ul>
<li><a href="#orgbcb3552">9.1. Next Step</a>
<ul>
<li><a href="#orgb7fba1e">9.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org27e861b">10. Conical Rolling Pin</a></li>
<li><a href="#orgb955921">11. GMP Forth</a></li>
</ul>
</div>
</div>
<p>
Not sure I want to re-open yet!
</p>

<div id="outline-container-org723dfaa" class="outline-2">
<h2 id="org723dfaa"><span class="section-number-2">1.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org137e9be" class="outline-3">
<h3 id="org137e9be"><span class="section-number-3">1.1.</span> Faust programming</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgb75c552" class="outline-4">
<h4 id="orgb75c552"><span class="section-number-4">1.1.1.</span> GAC code updates</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Most of the initial modules are done
</p>
</div>
</div>
<div id="outline-container-orgb2b65f7" class="outline-4">
<h4 id="orgb2b65f7"><span class="section-number-4">1.1.2.</span> xrso12332</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Wrote exploratory software for the XOSHIRO-128 PRNG
<a href="https://github.com/daniel-kelley/xrso12832">https://github.com/daniel-kelley/xrso12832</a>
In preparation for incorporation in GAC
</p>
</div>
</div>
</div>
<div id="outline-container-orgafacf83" class="outline-3">
<h3 id="orgafacf83"><span class="section-number-3">1.2.</span> Next Steps</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org1809145" class="outline-4">
<h4 id="org1809145"><span class="section-number-4">1.2.1.</span> Analog Synthesizer modules</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Waveshaper and Frequency Shifter
</p>
</div>
</div>
<div id="outline-container-orgdb8cec5" class="outline-4">
<h4 id="orgdb8cec5"><span class="section-number-4">1.2.2.</span> GAC Patch save/restore</h4>
</div>
<div id="outline-container-org8abfbe3" class="outline-4">
<h4 id="org8abfbe3"><span class="section-number-4">1.2.3.</span> LV2 autopatcher</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</div>
<div id="outline-container-orgf60b5e5" class="outline-4">
<h4 id="orgf60b5e5"><span class="section-number-4">1.2.4.</span> OSC control surface</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</div>
<div id="outline-container-org776d22c" class="outline-4">
<h4 id="org776d22c"><span class="section-number-4">1.2.5.</span> Faust/csound</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
See if a faust generated unit works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org583a212" class="outline-2">
<h2 id="org583a212"><span class="section-number-2">2.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org97d50b6" class="outline-3">
<h3 id="org97d50b6"><span class="section-number-3">2.1.</span> Next step</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org968afdb" class="outline-4">
<h4 id="org968afdb"><span class="section-number-4">2.1.1.</span> Check replacement sensor</h4>
</div>
<div id="outline-container-orge3fa467" class="outline-4">
<h4 id="orge3fa467"><span class="section-number-4">2.1.2.</span> Clean BME680/VELM6075 boards</h4>
</div>
<div id="outline-container-orgd60b724" class="outline-4">
<h4 id="orgd60b724"><span class="section-number-4">2.1.3.</span> Design more robust instrument shelter</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Use existing small mast for VEML6075; put others in larger shelter.
Use oil based polyurethane as conformal coating to protect PCBs.
Have aquired larger shelter
Need to design small enclosure for particle sensor
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org1dfe8c1" class="outline-2">
<h2 id="org1dfe8c1"><span class="section-number-2">3.</span> EPICS</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga9dd59c" class="outline-3">
<h3 id="orga9dd59c"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgbd2ccd3" class="outline-4">
<h4 id="orgbd2ccd3"><span class="section-number-4">3.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org4975e0a" class="outline-4">
<h4 id="org4975e0a"><span class="section-number-4">3.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgad71e8c" class="outline-4">
<h4 id="orgad71e8c"><span class="section-number-4">3.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orga4e7b9d" class="outline-2">
<h2 id="orga4e7b9d"><span class="section-number-2">4.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-4">
<p>
Still working!
</p>
</div>
<div id="outline-container-org472bc3d" class="outline-3">
<h3 id="org472bc3d"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgf74e2e4" class="outline-4">
<h4 id="orgf74e2e4"><span class="section-number-4">4.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org3c2413a" class="outline-4">
<h4 id="org3c2413a"><span class="section-number-4">4.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org5799229" class="outline-4">
<h4 id="org5799229"><span class="section-number-4">4.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orga850ce0" class="outline-2">
<h2 id="orga850ce0"><span class="section-number-2">5.</span> wktcolor</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org1cc75ae" class="outline-3">
<h3 id="org1cc75ae"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org364c7c4" class="outline-4">
<h4 id="org364c7c4"><span class="section-number-4">5.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5f740c" class="outline-2">
<h2 id="orgb5f740c"><span class="section-number-2">6.</span> wktplot</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org0ca09e7" class="outline-3">
<h3 id="org0ca09e7"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>

<div id="outline-container-org41888b9" class="outline-2">
<h2 id="org41888b9"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgb067841" class="outline-3">
<h3 id="orgb067841"><span class="section-number-3">7.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
None
</p>
</div>
</div>
</div>

<div id="outline-container-orgb09cdc3" class="outline-2">
<h2 id="orgb09cdc3"><span class="section-number-2">8.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org31e2759" class="outline-3">
<h3 id="org31e2759"><span class="section-number-3">8.1.</span> Next step</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgf76725e" class="outline-4">
<h4 id="orgf76725e"><span class="section-number-4">8.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org0d271a2" class="outline-2">
<h2 id="org0d271a2"><span class="section-number-2">9.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgbcb3552" class="outline-3">
<h3 id="orgbcb3552"><span class="section-number-3">9.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgb7fba1e" class="outline-4">
<h4 id="orgb7fba1e"><span class="section-number-4">9.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org27e861b" class="outline-2">
<h2 id="org27e861b"><span class="section-number-2">10.</span> Conical Rolling Pin</h2>
<div class="outline-text-2" id="text-10">
<p>
Softened point.
</p>
</div>
</div>
<div id="outline-container-orgb955921" class="outline-2">
<h2 id="orgb955921"><span class="section-number-2">11.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-11">
<p>
Need to think about adding floating point support
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>